#### Terraform Validation & Plan Results
* Terraform Version 📎`1.3.8`
* Working Directory 📂`./code/data-management-zone`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.azurerm_client_config.current: Reading...
azurerm_resource_group.automation_rg: Refreshing state... [id=/subscriptions/dfbd9ec6-9c65-43d6-bb61-bf7c4e221d9d/resourceGroups/dmgmt-dev-automation-rg]
data.azurerm_virtual_network.virtual_network: Reading...
azurerm_resource_group.consumption_rg: Refreshing state... [id=/subscriptions/dfbd9ec6-9c65-43d6-bb61-bf7c4e221d9d/resourceGroups/dmgmt-dev-consumption-rg]
azurerm_resource_group.governance_rg: Refreshing state... [id=/subscriptions/dfbd9ec6-9c65-43d6-bb61-bf7c4e221d9d/resourceGroups/dmgmt-dev-governance-rg]
azurerm_resource_group.container_rg: Refreshing state... [id=/subscriptions/dfbd9ec6-9c65-43d6-bb61-bf7c4e221d9d/resourceGroups/dmgmt-dev-container-rg]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jZWFlODIyNi1jMGFlLTQ4YmItOTRmZi00OTM4N2Q3YmMyY2E7b2JqZWN0SWQ9YmRkZWM2NjktYzEzYS00ZGExLTg5ZjMtMzgyYWMzYmFiZmM3O3N1YnNjcmlwdGlvbklkPWRmYmQ5ZWM2LTljNjUtNDNkNi1iYjYxLWJmN2M0ZTIyMWQ5ZDt0ZW5hbnRJZD0xNmIzYzAxMy1kMzAwLTQ2OGQtYWM2NC03ZWRhMDgyMGI2ZDM=]
azurerm_user_assigned_identity.user_assigned_identity: Refreshing state... [id=/subscriptions/dfbd9ec6-9c65-43d6-bb61-bf7c4e221d9d/resourceGroups/dmgmt-dev-automation-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/dmgmt-dev-uai001]
azurerm_synapse_private_link_hub.synapse_pl_hub: Refreshing state... [id=/subscriptions/dfbd9ec6-9c65-43d6-bb61-bf7c4e221d9d/resourceGroups/dmgmt-dev-consumption-rg/providers/Microsoft.Synapse/privateLinkHubs/dmgmtdevsynplh001]
azurerm_container_registry.container_registry: Refreshing state... [id=/subscriptions/dfbd9ec6-9c65-43d6-bb61-bf7c4e221d9d/resourceGroups/dmgmt-dev-container-rg/providers/Microsoft.ContainerRegistry/registries/dmgmtdevacr001]
azurerm_eventhub_namespace.eventhub_namespace: Refreshing state... [id=/subscriptions/dfbd9ec6-9c65-43d6-bb61-bf7c4e221d9d/resourceGroups/dmgmt-dev-governance-rg/providers/Microsoft.EventHub/namespaces/dmgmt-dev-evhns001]
azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/dfbd9ec6-9c65-43d6-bb61-bf7c4e221d9d/resourceGroups/dmgmt-dev-governance-rg/providers/Microsoft.KeyVault/vaults/dmgmt-dev-kv001]
data.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/dfbd9ec6-9c65-43d6-bb61-bf7c4e221d9d/resourceGroups/dmgmt-dev-network-rg/providers/Microsoft.Network/virtualNetworks/dmgmt-dev-vnet001]
azurerm_subnet.private_endpoint_subnet: Refreshing state... [id=/subscriptions/dfbd9ec6-9c65-43d6-bb61-bf7c4e221d9d/resourceGroups/dmgmt-dev-network-rg/providers/Microsoft.Network/virtualNetworks/dmgmt-dev-vnet001/subnets/ServicesSubnet]
azurerm_subnet_network_security_group_association.private_endpoint_subnet_nsg: Refreshing state... [id=/subscriptions/dfbd9ec6-9c65-43d6-bb61-bf7c4e221d9d/resourceGroups/dmgmt-dev-network-rg/providers/Microsoft.Network/virtualNetworks/dmgmt-dev-vnet001/subnets/ServicesSubnet]
azurerm_subnet_route_table_association.private_endpoint_subnet_routetable: Refreshing state... [id=/subscriptions/dfbd9ec6-9c65-43d6-bb61-bf7c4e221d9d/resourceGroups/dmgmt-dev-network-rg/providers/Microsoft.Network/virtualNetworks/dmgmt-dev-vnet001/subnets/ServicesSubnet]
azurerm_private_endpoint.synapse_pl_hub_private_endpoint: Refreshing state... [id=/subscriptions/dfbd9ec6-9c65-43d6-bb61-bf7c4e221d9d/resourceGroups/dmgmt-dev-consumption-rg/providers/Microsoft.Network/privateEndpoints/dmgmtdevsynplh001-pe]
azurerm_private_endpoint.key_vault_private_endpoint: Refreshing state... [id=/subscriptions/dfbd9ec6-9c65-43d6-bb61-bf7c4e221d9d/resourceGroups/dmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/dmgmt-dev-kv001-pe]
azurerm_private_endpoint.container_registry_private_endpoint: Refreshing state... [id=/subscriptions/dfbd9ec6-9c65-43d6-bb61-bf7c4e221d9d/resourceGroups/dmgmt-dev-container-rg/providers/Microsoft.Network/privateEndpoints/dmgmtdevacr001-pe]
azurerm_eventhub.eventhub_notification: Refreshing state... [id=/subscriptions/dfbd9ec6-9c65-43d6-bb61-bf7c4e221d9d/resourceGroups/dmgmt-dev-governance-rg/providers/Microsoft.EventHub/namespaces/dmgmt-dev-evhns001/eventhubs/notification]
azurerm_eventhub.eventhub_hook: Refreshing state... [id=/subscriptions/dfbd9ec6-9c65-43d6-bb61-bf7c4e221d9d/resourceGroups/dmgmt-dev-governance-rg/providers/Microsoft.EventHub/namespaces/dmgmt-dev-evhns001/eventhubs/hook]
azurerm_private_endpoint.eventhub_namespace_private_endpoint: Refreshing state... [id=/subscriptions/dfbd9ec6-9c65-43d6-bb61-bf7c4e221d9d/resourceGroups/dmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/dmgmt-dev-evhns001-pe]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_eventhub_namespace.eventhub_namespace will be updated in-place
  ~ resource "azurerm_eventhub_namespace" "eventhub_namespace" {
        id                                  = "/subscriptions/dfbd9ec6-9c65-43d6-bb61-bf7c4e221d9d/resourceGroups/dmgmt-dev-governance-rg/providers/Microsoft.EventHub/namespaces/dmgmt-dev-evhns001"
        name                                = "dmgmt-dev-evhns001"
      ~ network_rulesets                    = [
          ~ {
              ~ default_action                 = "Allow" -> "Deny"
                # (4 unchanged elements hidden)
            },
        ]
        tags                                = {}
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_private_endpoint.purview_private_endpoint_account will be created
  + resource "azurerm_private_endpoint" "purview_private_endpoint_account" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "dmgmt-dev-pview001-account-nic"
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "dmgmt-dev-pview001-account-pe"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "dmgmt-dev-governance-rg"
      + subnet_id                     = "/subscriptions/dfbd9ec6-9c65-43d6-bb61-bf7c4e221d9d/resourceGroups/dmgmt-dev-network-rg/providers/Microsoft.Network/virtualNetworks/dmgmt-dev-vnet001/subnets/ServicesSubnet"

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dmgmt-dev-pview001-account-pe"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "account",
            ]
        }
    }

  # azurerm_private_endpoint.purview_private_endpoint_portal will be created
  + resource "azurerm_private_endpoint" "purview_private_endpoint_portal" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "dmgmt-dev-pview001-portal-nic"
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "dmgmt-dev-pview001-portal-pe"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "dmgmt-dev-governance-rg"
      + subnet_id                     = "/subscriptions/dfbd9ec6-9c65-43d6-bb61-bf7c4e221d9d/resourceGroups/dmgmt-dev-network-rg/providers/Microsoft.Network/virtualNetworks/dmgmt-dev-vnet001/subnets/ServicesSubnet"

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dmgmt-dev-pview001-portal-pe"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "portal",
            ]
        }
    }

  # azurerm_purview_account.purview will be created
  + resource "azurerm_purview_account" "purview" {
      + atlas_kafka_endpoint_primary_connection_string   = (sensitive value)
      + atlas_kafka_endpoint_secondary_connection_string = (sensitive value)
      + catalog_endpoint                                 = (known after apply)
      + guardian_endpoint                                = (known after apply)
      + id                                               = (known after apply)
      + location                                         = "northeurope"
      + managed_resource_group_name                      = "dmgmt-dev-pview001-rg"
      + managed_resources                                = (known after apply)
      + name                                             = "dmgmt-dev-pview001"
      + public_network_enabled                           = false
      + resource_group_name                              = "dmgmt-dev-governance-rg"
      + scan_endpoint                                    = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azurerm_resource_deployment_script_azure_power_shell.purview_admin_onboarding will be created
  + resource "azurerm_resource_deployment_script_azure_power_shell" "purview_admin_onboarding" {
      + cleanup_preference     = "OnSuccess"
      + command_line           = "-PurviewId \"dmgmt-dev-pview001\" -PurviewRootCollectionAdmins "
      + force_update_tag       = (known after apply)
      + id                     = (known after apply)
      + location               = "northeurope"
      + name                   = "dmgmt-dev-pview001-admin-onb"
      + outputs                = (known after apply)
      + resource_group_name    = "dmgmt-dev-automation-rg"
      + retention_interval     = "P1D"
      + script_content         = <<-EOT
            # Licensed under the MIT license.
            
            # Define script arguments
            [CmdletBinding()]
            param (
                [Parameter(Mandatory = $true)]
                [ValidateNotNullOrEmpty()]
                [string]
                $PurviewId,
            
                [Parameter(Mandatory = $false)]
                [string[]]
                $PurviewRootCollectionAdmins = @(),
            
                [Parameter(Mandatory=$false)]
                [Switch]
                $SetPurviewAccountAsDefault
            )
            
            # Install Required Module
            Write-Output "Installing Required Module"
            Set-PSRepository `
                -Name PSGallery `
                -InstallationPolicy Trusted
            Install-Module `
                -Name Az.Purview `
                -Repository PSGallery `
                -Force
            
            # Define Parameters
            Write-Output "Defining Parameters"
            $tenantId = (Get-AzContext).Tenant.Id
            $purviewSubscriptionId = $PurviewId.Split("/")[2]
            $purviewResourceGroupName = $PurviewId.Split("/")[4]
            $purviewAccountName = $PurviewId.Split("/")[8]
            
            if ($SetPurviewAccountAsDefault) {
                # Set Purview Account as Default in Tenant
                Write-Output "Setting Purview Account as Default in Tenant"
                Set-AzPurviewDefaultAccount `
                    -ScopeTenantId $tenantId `
                    -ScopeType "Tenant" `
                    -Scope $tenantId `
                    -SubscriptionId $purviewSubscriptionId `
                    -ResourceGroupName $purviewResourceGroupName `
                    -AccountName $purviewAccountName
            } else {
                # NOT Set Purview Account as Default in Tenant
                Write-Output "NOT Setting Purview Account as Default in Tenant"
            }
            
            foreach ($purviewRootCollectionAdmin in $PurviewRootCollectionAdmins) {
                # Set Purview Root Collection Admin
                Write-Output "Setting Purview Root Collection Admin '${purviewRootCollectionAdmin}'"
                Add-AzPurviewAccountRootCollectionAdmin `
                    -SubscriptionId $purviewSubscriptionId `
                    -ResourceGroupName $purviewResourceGroupName `
                    -AccountName $purviewAccountName `
                    -ObjectId $purviewRootCollectionAdmin
            }
        EOT
      + supporting_script_uris = []
      + timeout                = "PT30M"
      + version                = "6.3"

      + container {
          + container_group_name = "dmgmt-dev-pview001-admin-onb"
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/dfbd9ec6-9c65-43d6-bb61-bf7c4e221d9d/resourceGroups/dmgmt-dev-automation-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/dmgmt-dev-uai001",
            ]
          + type         = "UserAssigned"
        }
    }

  # azurerm_role_assignment.purview_roleassignment_eventhub_hook will be created
  + resource "azurerm_role_assignment" "purview_roleassignment_eventhub_hook" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Event Hubs Data Receiver"
      + scope                            = "/subscriptions/dfbd9ec6-9c65-43d6-bb61-bf7c4e221d9d/resourceGroups/dmgmt-dev-governance-rg/providers/Microsoft.EventHub/namespaces/dmgmt-dev-evhns001/eventhubs/hook"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.purview_roleassignment_eventhub_notification will be created
  + resource "azurerm_role_assignment" "purview_roleassignment_eventhub_notification" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Event Hubs Data Sender"
      + scope                            = "/subscriptions/dfbd9ec6-9c65-43d6-bb61-bf7c4e221d9d/resourceGroups/dmgmt-dev-governance-rg/providers/Microsoft.EventHub/namespaces/dmgmt-dev-evhns001/eventhubs/notification"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.purview_roleassignment_key_vault will be created
  + resource "azurerm_role_assignment" "purview_roleassignment_key_vault" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/dfbd9ec6-9c65-43d6-bb61-bf7c4e221d9d/resourceGroups/dmgmt-dev-governance-rg/providers/Microsoft.KeyVault/vaults/dmgmt-dev-kv001"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.user_assigned_identity_roleassignment_governance_rg will be created
  + resource "azurerm_role_assignment" "user_assigned_identity_roleassignment_governance_rg" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c070e911-a740-4c5e-af01-ed8078f0ed82"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 8 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>